Revit 2024 API
TessellatedBuildIssue Methods
The TessellatedBuildIssue type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetIssueDescription
 Gets a string describing the issue. If the issue does not present a problem, then an empty string is returned.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidIssue
 Reports whether the issue is well-formed, valid and does describe a real problem.
MakesDataUnusable
 Reports whether this issue makes some data unusable ('true') or is only shows that data format conventions were broken, but the data are still usable (false).
ReportIssueToDataSource
 Reports whether this issue should be reported to the company which wrote the software which produced the face set data (true), or to Autodesk (false).
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
TessellatedBuildIssue Class
Autodesk.Revit.DB Namespace